Revit 2024 API
TransactionAttribute Properties
The TransactionAttribute type exposes the following members.
Properties
Name | Description
Mode
Transaction mode.
TypeId
When implemented in a derived class, gets a unique identifier for this Attribute.
 (Inherited from Attribute.)
See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace